In [1]:
import pandas as pd
from matplotlib import pyplot as plt 
import seaborn as sns

In [2]:
df = pd.read_csv("data/heights_with_outliers.csv")
df.head()

       name  height
0     Aarav    5.45
1   Deepika    8.20
2  Abhishek    5.65
3     Sneha    5.52
4     Kriti    5.69

In [4]:
mean = df.height.mean()
std = df.height.std()
mean, std

(np.float64(5.61118), np.float64(0.37265356335110805))

In [5]:
lower = mean - 3*std 
upper = mean + 3* std
lower, upper

(np.float64(4.493219309946676), np.float64(6.729140690053324))

In [6]:
df[(df['height'] < lower) | (df['height'] > upper) ]

       name  height
1   Deepika     8.2
16    Tanvi     3.2
57    Priya     3.4
76    Aarav     9.4